const simJsonData = [
    {
        "region": "雙北",
        "current_month": {
            "total": 935,
            "a": 29,
            "b": 156,
            "c": 477,
            "top_problems": {
                "a": "前／後燈(行進車輪轉動中)(後燈)(12)、前／後燈(行進車輪轉動中)(前燈)(5)、車鈴(無法發出鈴聲)(4)",
                "b": "座墊(表面破損、龜裂)(70)、車機功能(借、還車 無提示音、異常)(43)、外管完整(變速外管)(14)",
                "c": "車體外觀(車架 掉漆)(137)、車體外觀(前、後泥除 髒污／破損)(100)、置物籃(垃圾)(91)"
            }
        },
        "prev_month": {
            "total": 1053,
            "a": 58,
            "b": 201,
            "c": 553
        }
    },
    {
        "region": "桃園",
        "current_month": {
            "total": 244,
            "a": 6,
            "b": 40,
            "c": 131,
            "top_problems": {
                "a": "前／後燈(行進車輪轉動中)(後燈)(3)、車柱 功能檢查(借還車不順)(2)、車鈴(無法發出鈴聲)(1)",
                "b": "座墊(表面破損、龜裂)(19)、車機功能(借、還車 無提示音、異常)(6)、外管完整(變速外管)(3)",
                "c": "車體外觀(車架 掉漆)(70)、車體外觀(前、後泥除 髒污／破損)(26)、置物籃(垃圾)(25)"
            }
        },
        "prev_month": {
            "total": 246,
            "a": 22,
            "b": 37,
            "c": 113
        }
    },
    {
        "region": "新竹",
        "current_month": {
            "total": 102,
            "a": 4,
            "b": 19,
            "c": 41,
            "top_problems": {
                "a": "前／後燈(行進車輪轉動中)(後燈)(3)、車機功能(借不出還不回／車機異常)(1)",
                "b": "座墊(表面破損、龜裂)(9)、車機機殼(髒污／塗鴉／小廣告／褪色)(4)、前／後燈(暫停車輪靜止中)(借出後應恆亮【閃爍、時滅時亮勾選】)(2)",
                "c": "車體外觀(車架 掉漆)(13)、置物籃(破損 2根以上／缺固定螺絲／裝設歪斜)(10)、車體外觀(前、後泥除 髒污／破損)(8)"
            }
        },
        "prev_month": {
            "total": 105,
            "a": 5,
            "b": 11,
            "c": 49
        }
    },
    {
        "region": "苗栗",
        "current_month": {
            "total": 61,
            "a": 2,
            "b": 0,
            "c": 21,
            "top_problems": {
                "a": "前／後燈(行進車輪轉動中)(後燈)(1)",
                "b": "變速功能(指示蓋 (銀) 脫落)(1)",
                "c": "車體外觀(車架 掉漆)(7)、車柱 功能檢查(面板左下方燈光 未亮起)(6)、置物籃(垃圾)(2)"
            }
        },
        "prev_month": {
            "total": 60,
            "a": 1,
            "b": 3,
            "c": 26
        }
    },
    {
        "region": "台中",
        "current_month": {
            "total": 293,
            "a": 9,
            "b": 29,
            "c": 111,
            "top_problems": {
                "a": "前／後燈(行進車輪轉動中)(後燈)(4)、前／後燈(行進車輪轉動中)(前燈)(3)、車柱 功能檢查(借還車不順)(2)",
                "b": "車機功能(借、還車 無提示音、異常)(10)、騎乘行進(異音)(6)、車機功能(螢幕文字 無法正常顯示)(4)",
                "c": "車體外觀(車架 掉漆)(38)、置物籃(垃圾)(17)、車柱 功能檢查(面板左下方燈光 未亮起)(16)"
            }
        },
        "prev_month": {
            "total": 284,
            "a": 11,
            "b": 15,
            "c": 138
        }
    },
    {
        "region": "嘉義",
        "current_month": {
            "total": 66,
            "a": 2,
            "b": 11,
            "c": 21,
            "top_problems": {
                "a": "前／後燈(行進車輪轉動中)(後燈)(2)",
                "b": "座墊(表面破損、龜裂)(7)、騎乘行進(異音)(2)、車機功能(借、還車 無提示音、異常)(1)",
                "c": "車柱 功能檢查(面板左下方燈光 未亮起)(6)、車體外觀(車架 掉漆)(6)、車鈴(貼紙文字無法傳達完整訊息)(4)"
            }
        },
        "prev_month": {
            "total": 86,
            "a": 1,
            "b": 44,
            "c": 24
        }
    },
    {
        "region": "台南",
        "current_month": {
            "total": 156,
            "a": 4,
            "b": 22,
            "c": 61,
            "top_problems": {
                "a": "前／後燈(行進車輪轉動中)(後燈)(2)、前／後燈(行進車輪轉動中)(前燈)(1)、煞車功能(無法煞車)(1)",
                "b": "座墊(表面破損、龜裂)(12)、騎乘行進(異音)(5)、外管完整(蛇管 脫落／遺失)(3)",
                "c": "置物籃貼紙(後 使用說明)(16)、把手貼紙(左 騎乘前檢查)(16)、一級檢修貼紙(無法辨識／資訊不完整)(11)"
            }
        },
        "prev_month": {
            "total": 156,
            "a": 6,
            "b": 20,
            "c": 61
        }
    },
    {
        "region": "高雄",
        "current_month": {
            "total": 287,
            "a": 23,
            "b": 66,
            "c": 175,
            "top_problems": {
                "a": "前／後燈(行進車輪轉動中)(後燈)(12)、前／後燈(行進車輪轉動中)(前燈)(7)、車鈴(無法發出鈴聲)(7)",
                "b": "座墊(表面破損、龜裂)(30)、車機功能(借、還車 無提示音、異常)(13)、騎乘行進(異音)(12)",
                "c": "車體外觀(車架 掉漆)(80)、置物籃(破損 2根以上／缺固定螺絲／裝設歪斜)(48)、置物籃貼紙(後 使用說明)(27)"
            }
        },
        "prev_month": {
            "total": 288,
            "a": 20,
            "b": 83,
            "c": 159
        }
    },
    {
        "region": "屏東",
        "current_month": {
            "total": 40,
            "a": 6,
            "b": 4,
            "c": 8,
            "top_problems": {
                "a": "前／後燈(行進車輪轉動中)(後燈)(2)、前／後燈(行進車輪轉動中)(前燈)(2)、煞車功能(無法煞車)(1)",
                "b": "座墊(表面破損、龜裂)(2)、輪胎(胎紋磨損 平滑、龜裂、反光帶脫落)(1)、騎乘行進(異音)(1)",
                "c": "車鈴(貼紙文字無法傳達完整訊息)(2)、置物籃(破損 2根以上／缺固定螺絲／裝設歪斜)(2)、把手貼紙(左 騎乘前檢查)(1)"
            }
        },
        "prev_month": {
            "total": 40,
            "a": 4,
            "b": 7,
            "c": 13
        }
    },
    {
        "region": "台東",
        "current_month": {
            "total": 24,
            "a": 2,
            "b": 0,
            "c": 4,
            "top_problems": {
                "a": "前／後燈(行進車輪轉動中)(前燈)(1)、前／後燈(行進車輪轉動中)(後燈)(1)",
                "b": "目前無具體問題紀錄",
                "c": "置物籃(嚴重髒汙、沾黏)(1)、置物籃(垃圾)(1)、置物籃貼紙(後 使用說明)(1)"
            }
        },
        "prev_month": {
            "total": 24,
            "a": 3,
            "b": 0,
            "c": 7
        }
    }
];