const simJsonData = [
    {
        "region": "雙北",
        "current_month": {
            "total": 1053,
            "a": 58,
            "b": 201,
            "c": 556,
            "top_problems": {
                "a": "前／後燈(行進車輪轉動中)(後燈)(25)、前／後燈(行進車輪轉動中)(前燈)(12)、車鈴(無法發出鈴聲)(10)",
                "b": "車體外觀(前、後泥除 髒污／破損)(119)、座墊(表面破損、龜裂)(84)、車機功能(借、還車 無提示音、異常)(58)",
                "c": "置物籃(垃圾)(107)、車體外觀(車架 掉漆)(88)、置物籃(破損 2根以上／缺固定螺絲／裝設歪斜)(63)"
            }
        },
        "prev_month": {
            "total": 750,
            "a": 54,
            "b": 116,
            "c": 439
        }
    },
    {
        "region": "桃園",
        "current_month": {
            "total": 246,
            "a": 22,
            "b": 37,
            "c": 112,
            "top_problems": {
                "a": "前／後燈(行進車輪轉動中)(後燈)(10)、前／後燈(行進車輪轉動中)(前燈)(4)、車柱 功能檢查(借還車不順)(3)",
                "b": "車機功能(借、還車 無提示音、異常)(11)、座墊(表面破損、龜裂)(9)、車體外觀(前、後泥除 髒污／破損)(6)",
                "c": "車體外觀(車架 掉漆)(57)、置物籃(垃圾)(11)、置物籃(破損 2根以上／缺固定螺絲／裝設歪斜)(11)"
            }
        },
        "prev_month": {
            "total": 297,
            "a": 13,
            "b": 38,
            "c": 151
        }
    },
    {
        "region": "新竹",
        "current_month": {
            "total": 105,
            "a": 5,
            "b": 11,
            "c": 48,
            "top_problems": {
                "a": "前／後燈(行進車輪轉動中)(後燈)(2)、車柱 功能檢查(借還車不順)(1)、前／後燈(行進車輪轉動中)(前燈)(1)",
                "b": "座墊(表面破損、龜裂)(5)、車體外觀(前、後泥除 髒污／破損)(3)、前／後燈(暫停車輪靜止中)(借出刷卡、臨停解鎖即亮【未即亮勾選】)(2)",
                "c": "車體外觀(車架 掉漆)(25)、置物籃(垃圾)(6)、置物籃(破損 2根以上／缺固定螺絲／裝設歪斜)(6)"
            }
        },
        "prev_month": {
            "total": 103,
            "a": 3,
            "b": 10,
            "c": 38
        }
    },
    {
        "region": "苗栗",
        "current_month": {
            "total": 60,
            "a": 1,
            "b": 3,
            "c": 30,
            "top_problems": {
                "a": "車機功能(借不出還不回／車機異常)(1)",
                "b": "車體外觀(前、後泥除 髒污／破損)(2)、車機機殼(髒污／塗鴉／小廣告／褪色)(1)、車機功能(螢幕文字 無法正常顯示)(1)",
                "c": "車體外觀(車架 掉漆)(15)、車柱 外觀檢查(柱號貼紙)(2)、置物籃(破損 2根以上／缺固定螺絲／裝設歪斜)(1)"
            }
        },
        "prev_month": {
            "total": 48,
            "a": 4,
            "b": 3,
            "c": 38
        }
    },
    {
        "region": "台中",
        "current_month": {
            "total": 284,
            "a": 11,
            "b": 15,
            "c": 137,
            "top_problems": {
                "a": "前／後燈(行進車輪轉動中)(後燈)(7)、前／後燈(行進車輪轉動中)(前燈)(2)、車鈴(無法發出鈴聲)(1)",
                "b": "車體外觀(前、後泥除 髒污／破損)(12)、車機功能(借、還車 無提示音、異常)(4)、座墊(表面破損、龜裂)(4)",
                "c": "車體外觀(車架 掉漆)(48)、置物籃(垃圾)(16)、置物籃(破損 2根以上／缺固定螺絲／裝設歪斜)(11)"
            }
        },
        "prev_month": {
            "total": 260,
            "a": 5,
            "b": 23,
            "c": 149
        }
    },
    {
        "region": "嘉義",
        "current_month": {
            "total": 86,
            "a": 1,
            "b": 44,
            "c": 23,
            "top_problems": {
                "a": "前／後燈(行進車輪轉動中)(後燈)(1)",
                "b": "外管完整(煞車外管)(27)、座墊(表面破損、龜裂)(14)、外管完整(變速外管)(11)",
                "c": "置物籃(垃圾)(6)、置物籃(破損 2根以上／缺固定螺絲／裝設歪斜)(3)、防轉彈簧／停車架(彈簧脫落)(1)"
            }
        },
        "prev_month": {
            "total": 60,
            "a": 5,
            "b": 15,
            "c": 38
        }
    },
    {
        "region": "台南",
        "current_month": {
            "total": 156,
            "a": 6,
            "b": 20,
            "c": 61,
            "top_problems": {
                "a": "前／後燈(行進車輪轉動中)(後燈)(4)、前／後燈(行進車輪轉動中)(前燈)(2)",
                "b": "座墊(表面破損、龜裂)(11)、外管完整(蛇管 脫落／遺失)(4)、輪胎(胎紋磨損 平滑、龜裂、反光帶脫落)(1)",
                "c": "車體外觀(車架 掉漆)(11)、置物籃貼紙(後 使用說明)(10)、置物籃(破損 2根以上／缺固定螺絲／裝設歪斜)(9)"
            }
        },
        "prev_month": {
            "total": 151,
            "a": 3,
            "b": 14,
            "c": 70
        }
    },
    {
        "region": "高雄",
        "current_month": {
            "total": 288,
            "a": 20,
            "b": 84,
            "c": 163,
            "top_problems": {
                "a": "前／後燈(行進車輪轉動中)(後燈)(9)、前／後燈(行進車輪轉動中)(前燈)(4)、車鈴(無法發出鈴聲)(3)",
                "b": "座墊(表面破損、龜裂)(51)、車機功能(借、還車 無提示音、異常)(11)、車體外觀(前、後泥除 髒污／破損)(10)",
                "c": "車體外觀(車架 掉漆)(68)、置物籃(破損 2根以上／缺固定螺絲／裝設歪斜)(49)、置物籃貼紙(後 使用說明)(22)"
            }
        },
        "prev_month": {
            "total": 288,
            "a": 18,
            "b": 80,
            "c": 189
        }
    },
    {
        "region": "屏東",
        "current_month": {
            "total": 40,
            "a": 4,
            "b": 7,
            "c": 12,
            "top_problems": {
                "a": "前／後燈(行進車輪轉動中)(前燈)(3)、前／後燈(行進車輪轉動中)(後燈)(1)、煞車功能(煞車過鬆 ( 2/3仍無法煞停 ))(1)",
                "b": "車機功能(借、還車 無提示音、異常)(3)、座墊(表面破損、龜裂)(2)、煞車功能(異音)(1)",
                "c": "車體外觀(車架 掉漆)(4)、車機機殼(太陽能面板 產生氣泡)(2)、置物籃(垃圾)(1)"
            }
        },
        "prev_month": {
            "total": 40,
            "a": 5,
            "b": 10,
            "c": 16
        }
    },
    {
        "region": "台東",
        "current_month": {
            "total": 24,
            "a": 3,
            "b": 0,
            "c": 7,
            "top_problems": {
                "a": "煞車功能(無法煞車)(1)、前／後燈(行進車輪轉動中)(前燈)(1)、前／後燈(行進車輪轉動中)(後燈)(1)",
                "b": "目前無具體問題紀錄",
                "c": "置物籃(破損 2根以上／缺固定螺絲／裝設歪斜)(2)、置物籃(嚴重髒汙、沾黏)(1)、一級檢修貼紙(無法辨識／資訊不完整)(1)"
            }
        },
        "prev_month": {
            "total": 24,
            "a": 1,
            "b": 2,
            "c": 8
        }
    }
];