const simJsonData = [
    {
        "region": "雙北",
        "current_month": {
            "total": 870,
            "a": 45,
            "b": 148,
            "c": 490,
            "top_problems": {
                "a": "前／後燈(行進車輪轉動中)(後燈)(17)、前／後燈(行進車輪轉動中)(前燈)(9)、車鈴(無法發出鈴聲)(9)",
                "b": "座墊(表面破損、龜裂)(42)、車機功能(借、還車 無提示音、異常)(32)、外管完整(變速外管)(18)",
                "c": "車體外觀(車架 掉漆)(130)、車體外觀(前、後泥除 髒污／破損)(99)、置物籃(垃圾)(89)"
            }
        },
        "prev_month": {
            "total": 935,
            "a": 29,
            "b": 156,
            "c": 477
        }
    },
    {
        "region": "桃園",
        "current_month": {
            "total": 238,
            "a": 9,
            "b": 44,
            "c": 114,
            "top_problems": {
                "a": "前／後燈(行進車輪轉動中)(前燈)(2)、前／後燈(行進車輪轉動中)(後燈)(2)、車鈴(無法發出鈴聲)(2)",
                "b": "座墊(表面破損、龜裂)(15)、車機機殼(髒污／塗鴉／小廣告／褪色)(8)、外管完整(變速外管)(4)",
                "c": "車體外觀(車架 掉漆)(57)、置物籃(破損 2根以上／缺固定螺絲／裝設歪斜)(22)、車體外觀(車架 髒汙／小廣告／塗鴉)(15)"
            }
        },
        "prev_month": {
            "total": 244,
            "a": 6,
            "b": 40,
            "c": 131
        }
    },
    {
        "region": "新竹",
        "current_month": {
            "total": 105,
            "a": 4,
            "b": 13,
            "c": 64,
            "top_problems": {
                "a": "前／後燈(行進車輪轉動中)(後燈)(3)、前／後燈(行進車輪轉動中)(前燈)(2)、煞車功能(無法煞車)(1)",
                "b": "座墊(表面破損、龜裂)(3)、車機功能(借、還車 無提示音、異常)(2)、輪胎(胎紋磨損 平滑、龜裂、反光帶脫落)(2)",
                "c": "車體外觀(車架 掉漆)(32)、置物籃(垃圾)(14)、車柱 功能檢查(面板左下方燈光 未亮起)(10)"
            }
        },
        "prev_month": {
            "total": 102,
            "a": 4,
            "b": 19,
            "c": 41
        }
    },
    {
        "region": "苗栗",
        "current_month": {
            "total": 64,
            "a": 2,
            "b": 6,
            "c": 23,
            "top_problems": {
                "a": "車鈴(無法發出鈴聲)(1)、前／後燈(行進車輪轉動中)(後燈)(1)",
                "b": "座墊(表面破損、龜裂)(2)、隨車鎖(上鎖／解鎖 失敗、異常)(1)、車機功能(螢幕文字 無法正常顯示)(1)",
                "c": "車體外觀(車架 掉漆)(7)、置物籃(嚴重髒汙、沾黏)(4)、變速功能(上蓋 (黑) 脫落／檔位標示無法辨識)(3)"
            }
        },
        "prev_month": {
            "total": 61,
            "a": 2,
            "b": 0,
            "c": 21
        }
    },
    {
        "region": "台中",
        "current_month": {
            "total": 254,
            "a": 14,
            "b": 39,
            "c": 102,
            "top_problems": {
                "a": "前／後燈(行進車輪轉動中)(後燈)(7)、車鈴(無法發出鈴聲)(3)、煞車功能(煞車過鬆 ( 2/3仍無法煞停 ))(2)",
                "b": "車機功能(借、還車 無提示音、異常)(14)、車機功能(螢幕文字 無法正常顯示)(10)、座墊(表面破損、龜裂)(10)",
                "c": "車體外觀(車架 掉漆)(31)、車柱 功能檢查(面板左下方燈光 未亮起)(14)、置物籃(破損 2根以上／缺固定螺絲／裝設歪斜)(12)"
            }
        },
        "prev_month": {
            "total": 293,
            "a": 9,
            "b": 29,
            "c": 111
        }
    },
    {
        "region": "嘉義",
        "current_month": {
            "total": 86,
            "a": 7,
            "b": 21,
            "c": 32,
            "top_problems": {
                "a": "車鈴(無法發出鈴聲)(3)、前／後燈(行進車輪轉動中)(前燈)(2)、前／後燈(行進車輪轉動中)(後燈)(1)",
                "b": "座墊(表面破損、龜裂)(12)、外管完整(變速外管)(5)、車機功能(借、還車 無提示音、異常)(4)",
                "c": "置物籃(垃圾)(7)、置物籃(破損 2根以上／缺固定螺絲／裝設歪斜)(7)、一級檢修貼紙(無法辨識／資訊不完整)(5)"
            }
        },
        "prev_month": {
            "total": 66,
            "a": 2,
            "b": 11,
            "c": 21
        }
    },
    {
        "region": "台南",
        "current_month": {
            "total": 156,
            "a": 8,
            "b": 17,
            "c": 53,
            "top_problems": {
                "a": "車鈴(無法發出鈴聲)(4)、前／後燈(行進車輪轉動中)(前燈)(1)、前／後燈(行進車輪轉動中)(後燈)(1)",
                "b": "座墊(表面破損、龜裂)(8)、車機功能(借、還車 無提示音、異常)(3)、外管完整(蛇管 脫落／遺失)(3)",
                "c": "把手貼紙(左 騎乘前檢查)(19)、一級檢修貼紙(無法辨識／資訊不完整)(17)、置物籃貼紙(後 使用說明)(8)"
            }
        },
        "prev_month": {
            "total": 156,
            "a": 4,
            "b": 22,
            "c": 61
        }
    },
    {
        "region": "高雄",
        "current_month": {
            "total": 267,
            "a": 23,
            "b": 36,
            "c": 159,
            "top_problems": {
                "a": "車鈴(無法發出鈴聲)(14)、前／後燈(行進車輪轉動中)(後燈)(9)、前／後燈(行進車輪轉動中)(前燈)(3)",
                "b": "車機功能(借、還車 無提示音、異常)(10)、騎乘行進(異音)(6)、外管完整(變速外管)(6)",
                "c": "車體外觀(車架 掉漆)(80)、置物籃(破損 2根以上／缺固定螺絲／裝設歪斜)(37)、一級檢修貼紙(無法辨識／資訊不完整)(35)"
            }
        },
        "prev_month": {
            "total": 287,
            "a": 23,
            "b": 66,
            "c": 175
        }
    },
    {
        "region": "屏東",
        "current_month": {
            "total": 40,
            "a": 5,
            "b": 7,
            "c": 10,
            "top_problems": {
                "a": "車鈴(無法發出鈴聲)(4)、前／後燈(行進車輪轉動中)(後燈)(1)",
                "b": "車機功能(螢幕文字 無法正常顯示)(3)、外管完整(變速外管)(1)、電量(無顯示／未持續顯示)(1)",
                "c": "一級檢修貼紙(無法辨識／資訊不完整)(3)、車體外觀(車架 掉漆)(3)、把手套(黏潮、紋路磨損、破損)(1)"
            }
        },
        "prev_month": {
            "total": 40,
            "a": 6,
            "b": 4,
            "c": 8
        }
    },
    {
        "region": "台東",
        "current_month": {
            "total": 24,
            "a": 2,
            "b": 0,
            "c": 4,
            "top_problems": {
                "a": "前／後燈(行進車輪轉動中)(前燈)(1)、車鈴(無法發出鈴聲)(1)",
                "b": "目前無具體問題紀錄",
                "c": "置物籃(破損 2根以上／缺固定螺絲／裝設歪斜)(3)、置物籃(垃圾)(1)、把手貼紙(左 騎乘前檢查)(1)"
            }
        },
        "prev_month": {
            "total": 24,
            "a": 2,
            "b": 0,
            "c": 4
        }
    }
];