const simJsonData = [
    {
        "region": "雙北",
        "current_month": {
            "total": 750,
            "a": 54,
            "b": 116,
            "c": 435,
            "top_problems": {
                "a": "前／後燈(行進車輪轉動中)(後燈)(17)、車鈴(無法發出鈴聲)(13)、前／後燈(行進車輪轉動中)(前燈)(11)",
                "b": "車體外觀(前、後泥除 髒污／破損)(54)、座墊(表面破損、龜裂)(52)、車機功能(借、還車 無提示音、異常)(24)",
                "c": "車體外觀(車架 掉漆)(99)、置物籃(垃圾)(69)、置物籃(破損 2根以上／缺固定螺絲／裝設歪斜)(51)"
            }
        },
        "prev_month": {
            "total": 880,
            "a": 72,
            "b": 164,
            "c": 471
        }
    },
    {
        "region": "桃園",
        "current_month": {
            "total": 297,
            "a": 13,
            "b": 38,
            "c": 147,
            "top_problems": {
                "a": "前／後燈(行進車輪轉動中)(後燈)(4)、車機功能(借不出還不回／車機異常)(3)、煞車功能(煞車過鬆 ( 2/3仍無法煞停 ))(2)",
                "b": "座墊(表面破損、龜裂)(17)、車體外觀(前、後泥除 髒污／破損)(7)、車機功能(借、還車 無提示音、異常)(6)",
                "c": "車體外觀(車架 掉漆)(33)、置物籃(垃圾)(30)、置物籃(破損 2根以上／缺固定螺絲／裝設歪斜)(18)"
            }
        },
        "prev_month": {
            "total": 287,
            "a": 18,
            "b": 52,
            "c": 135
        }
    },
    {
        "region": "新竹",
        "current_month": {
            "total": 103,
            "a": 3,
            "b": 10,
            "c": 38,
            "top_problems": {
                "a": "前／後燈(行進車輪轉動中)(後燈)(2)、車鈴(無法發出鈴聲)(1)",
                "b": "座墊(表面破損、龜裂)(7)、車體外觀(前、後泥除 髒污／破損)(2)、前／後燈(暫停車輪靜止中)(借出刷卡、臨停解鎖即亮【未即亮勾選】)(2)",
                "c": "置物籃(垃圾)(7)、置物籃(破損 2根以上／缺固定螺絲／裝設歪斜)(6)、車體外觀(車架 掉漆)(6)"
            }
        },
        "prev_month": {
            "total": 92,
            "a": 10,
            "b": 14,
            "c": 49
        }
    },
    {
        "region": "苗栗",
        "current_month": {
            "total": 48,
            "a": 4,
            "b": 3,
            "c": 38,
            "top_problems": {
                "a": "前／後燈(行進車輪轉動中)(後燈)(2)、前／後燈(行進車輪轉動中)(前燈)(2)",
                "b": "車體外觀(前、後泥除 髒污／破損)(8)、座墊(表面破損、龜裂)(1)",
                "c": "車體外觀(車架 掉漆)(22)、置物籃貼紙(後 使用說明)(4)、後泥除貼紙(車號)(3)"
            }
        },
        "prev_month": {
            "total": 50,
            "a": 0,
            "b": 2,
            "c": 15
        }
    },
    {
        "region": "台中",
        "current_month": {
            "total": 260,
            "a": 5,
            "b": 23,
            "c": 149,
            "top_problems": {
                "a": "車鈴(無法發出鈴聲)(2)、煞車功能(煞車過鬆 ( 2/3仍無法煞停 ))(1)、前／後燈(行進車輪轉動中)(前燈)(1)",
                "b": "座墊(表面破損、龜裂)(8)、車機功能(借、還車 無提示音、異常)(4)、輪胎(胎紋磨損 平滑、龜裂、反光帶脫落)(4)",
                "c": "車體外觀(車架 掉漆)(47)、置物籃(垃圾)(33)、置物籃(破損 2根以上／缺固定螺絲／裝設歪斜)(9)"
            }
        },
        "prev_month": {
            "total": 281,
            "a": 12,
            "b": 29,
            "c": 110
        }
    },
    {
        "region": "嘉義",
        "current_month": {
            "total": 60,
            "a": 5,
            "b": 15,
            "c": 38,
            "top_problems": {
                "a": "前／後燈(行進車輪轉動中)(後燈)(4)、車鈴(無法發出鈴聲)(1)、前／後燈(行進車輪轉動中)(前燈)(1)",
                "b": "座墊(表面破損、龜裂)(7)、車體外觀(前、後泥除 髒污／破損)(4)、車機功能(借、還車 無提示音、異常)(3)",
                "c": "車體外觀(車架 掉漆)(10)、置物籃(破損 2根以上／缺固定螺絲／裝設歪斜)(7)、置物籃(嚴重髒汙、沾黏)(6)"
            }
        },
        "prev_month": {
            "total": 80,
            "a": 4,
            "b": 20,
            "c": 23
        }
    },
    {
        "region": "台南",
        "current_month": {
            "total": 151,
            "a": 3,
            "b": 14,
            "c": 70,
            "top_problems": {
                "a": "車鈴(無法發出鈴聲)(2)、前／後燈(行進車輪轉動中)(前燈)(1)、前／後燈(行進車輪轉動中)(後燈)(1)",
                "b": "外管完整(蛇管 脫落／遺失)(4)、座墊(表面破損、龜裂)(3)、煞車功能(異音)(2)",
                "c": "置物籃貼紙(後 使用說明)(17)、置物籃(破損 2根以上／缺固定螺絲／裝設歪斜)(9)、車體外觀(車架 掉漆)(7)"
            }
        },
        "prev_month": {
            "total": 152,
            "a": 9,
            "b": 21,
            "c": 76
        }
    },
    {
        "region": "高雄",
        "current_month": {
            "total": 288,
            "a": 18,
            "b": 80,
            "c": 188,
            "top_problems": {
                "a": "前／後燈(行進車輪轉動中)(後燈)(7)、車鈴(無法發出鈴聲)(6)、前／後燈(行進車輪轉動中)(前燈)(3)",
                "b": "座墊(表面破損、龜裂)(46)、車機功能(借、還車 無提示音、異常)(14)、車體外觀(前、後泥除 髒污／破損)(9)",
                "c": "置物籃(破損 2根以上／缺固定螺絲／裝設歪斜)(73)、車體外觀(車架 掉漆)(69)、置物籃貼紙(後 使用說明)(26)"
            }
        },
        "prev_month": {
            "total": 288,
            "a": 10,
            "b": 69,
            "c": 196
        }
    },
    {
        "region": "屏東",
        "current_month": {
            "total": 40,
            "a": 5,
            "b": 10,
            "c": 16,
            "top_problems": {
                "a": "前／後燈(行進車輪轉動中)(後燈)(2)、前／後燈(行進車輪轉動中)(前燈)(1)、車鈴(無法發出鈴聲)(1)",
                "b": "座墊(表面破損、龜裂)(6)、煞車功能(異音)(1)、車體外觀(前、後泥除 髒污／破損)(1)",
                "c": "車機機殼(太陽能面板 產生氣泡)(2)、置物籃(破損 2根以上／缺固定螺絲／裝設歪斜)(2)、置物籃貼紙(後 使用說明)(2)"
            }
        },
        "prev_month": {
            "total": 40,
            "a": 5,
            "b": 7,
            "c": 12
        }
    },
    {
        "region": "台東",
        "current_month": {
            "total": 24,
            "a": 1,
            "b": 2,
            "c": 8,
            "top_problems": {
                "a": "前／後燈(行進車輪轉動中)(前燈)(1)",
                "b": "座墊(表面破損、龜裂)(2)",
                "c": "置物籃(破損 2根以上／缺固定螺絲／裝設歪斜)(1)、置物籃(垃圾)(1)"
            }
        },
        "prev_month": {
            "total": 24,
            "a": 1,
            "b": 3,
            "c": 10
        }
    }
];